/**
******************************************************************************
  * @file       global.c
  * @brief      全局变量定义
  * @version    1.0
  * @date       Aug-14-2019 Wed
******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "global.h"


/** @addtogroup Global variables
  * @{
  */

/* Global varaiables ---------------------------------------------------------*/
SmartLockStu SmartLock = 
{
	"201988",// 管理员密码
	"201988",// 用户密码
	0x01,// 默认静音
	RESET, // 锁状态
	RESET, // EEPROM默认不启用
	{'2','0','1','9','0','8','0','8','2','0','1','9','0','8','0','8',}//默认RFID 验证数据
};

TimeStu UserTime ={2019,8,4,8,0,0,0};

FingerPackStu FingerPack = {0};

u8 StringBuff[BUFF_LENGTH] = {0}; // 输入缓冲区

u16 gTouchStatus = 0; // 记录每次由MPR121读取到的按键状态

u8 CurrentWindowMode = 0;
u8 CurrentUserMode = 0;

u8 ReversalFlag = 0;

u32 UnBusy_Count = 0;

u32 TimeDisplay = 0;

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/
/* Exported functions --------------------------------------------------------*/
    
/**
  * @}
  */
